---
kind: method
id: M:Autodesk.Revit.DB.FilterInverseRule.#ctor(Autodesk.Revit.DB.FilterRule)
source: html/58bdcc4a-e195-93b7-63ad-31d79f46c90d.htm
---
# Autodesk.Revit.DB.FilterInverseRule.#ctor Method

Constructs a new instance of FilterInverseRule.

## Syntax (C#)
```csharp
public FilterInverseRule(
	FilterRule innerRule
)
```

## Parameters
- **innerRule** (`Autodesk.Revit.DB.FilterRule`) - The rule to invert.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null